app/controllers/tweets_controller.rb

  def show
    @tweet = Tweet.find_by(id: params[:id])
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @tweet = Tweet.new(tweet_params)
    if @tweet.save
---
INSERT INTO "tweets" ("body", "created_at", "updated_at") VALUES (?, ?, ?)  [["body", "test .etest\r\n"], ["created_at", "2019-07-04 02:11:15.974935"], ["updated_at", "2019-07-04 02:11:15.974935"]]

  def edit
    @tweet = Tweet.find_by(id: params[:id])
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def update
    @tweet = Tweet.find_by(id: params[:id])
    if @tweet.update(tweet_params)
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "tweets" SET "body" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["body", "smer\r\n"], ["updated_at", "2019-07-09 10:46:31.371336"], ["id", 8]]

  def destroy
    @tweet = Tweet.find_by(id: params[:id])
    @tweet.destroy
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 1]]